Revit 2024 API
Rebar.GetHookOrientation Method
 Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public RebarHookOrientation GetHookOrientation(
	int iEnd
)
Visual Basic
Public Function GetHookOrientation ( _
	iEnd As Integer _
) As RebarHookOrientation
Visual C++
public:
RebarHookOrientation GetHookOrientation(
	int iEnd
)
Parameters
iEnd
Type: System.Int32
 0 for the start hook, 1 for the end hook.
Return Value
 Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  iEnd must be 0 or 1.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace